CF/InformationRegisters/ШаблоныРегистрацииНовыхКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ШаблоныРегистрацииНовыхКарт</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПроводитьОпросВладельцаПриРегистрации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДисконтнойКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДисконтныхКарт</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БонуснаяПрограммаЛояльности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БонусныеПрограммыЛояльности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаВладельцаКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидКарты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИнформационныхКарт</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДлинаКода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачалоДиапазона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>99</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонецДиапазона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>99</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CF/Catalogs/ИнформационныеКарты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ИнформационныеКарты</Name>
			<Comment>(Упр) Магнитные и штриховые карты.</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКарты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИнформационныхКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДисконтнойКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДисконтныхКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКарты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИнформационныхКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоОпроса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСледующегоОпроса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БонуснаяПрограммаЛояльности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БонусныеПрограммыЛояльности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартаДляНакоплений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаВладельцаКартыПоШаблону</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CF/CommonModules/ИнформационныеКартыКлиент/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Функция вызывает вопрос о подтверждении создания информационной карты.
// Параметры:
//		ТекстВопросаНовойКарты - Строка - текст вопроса пользователю.
//		РежимРМКУправляемый - Булево - определяет, каким образом будет вызываться диалог вопроса:
//										встроенной функцией или специализированной формой.
// Возвращаемое значение
// 		РазрешеноСоздатьКарту - Булево - Истина, если пользователь подтвердил создание карты, Ложь - иначе.
Процедура ПолучитьРазрешениеПользователяНаСозданиеКарты(ОписаниеОповещения, ТекстВопросаНовойКарты) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ТекстВопросаНовойКарты) Тогда
		ТекстВопросаНовойКарты = НСтр("ru = 'Создать новую информационную карту?'")
	КонецЕсли;
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопросаНовойКарты, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры 

// Функция подготавливает текст оповещения о создании дисконтной карты
// и вызывает окно оповещения пользователя.
// Параметры:
//		ИнформационнаяКарта - СправочникСсылка.ИнформационныеКарты - ссылка на созданную карту.
// Возвращаемое значение
// 		нет
Функция ОповеститьОСозданииНовойКарты(ИнформационнаяКарта) Экспорт
	
	Если ЗначениеЗаполнено(ИнформационнаяКарта) Тогда
		
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'Создана информационная карта'"),
			,
			СтрЗаменить(НСтр("ru = 'Создана информационная карта ""%Карта%""'"), "%Карта%", ИнформационнаяКарта),
			БиблиотекаКартинок.Информация32);
		
	КонецЕсли;	
		
КонецФункции	

// Процедура подготавливает параметры открытия формы
// и открывает форму опроса владельца дисконтной карты
// если на указанную дату нужно проводить опрос.
// Параметры:
//		Карта - СправочникСсылка.ИнформационныеКарты - ссылка на проверяемую карту.
//		ДатаСобытия - Дата - дата проверки.
Процедура ПровестиОпросВладельца(Карта, ДатаСобытия) Экспорт
	
	НуженОпрос = ИнформационныеКартыВызовСервера.НеобходимостьОпросаВладельца(Карта, ДатаСобытия);
	Если НуженОпрос Тогда
        
        // &ЗамерПроизводительности
	    ОценкаПроизводительностиРТКлиент.НачатьЗамер(
		         Истина, "Справочник.ИнформационныеКарты.Форма.ФормаОпросаПоДисконтнойКарте.Открытие");

		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Карта", Карта);
		
		ОткрытьФорму("Справочник.ИнформационныеКарты.Форма.ФормаОпросаПоДисконтнойКарте", ПараметрыФормы);
		
	КонецЕсли;

КонецПроцедуры // ПровестиОпросВладельца()

// Процедура создает дисконтную карту по шаблону
// После чего вызывает обработку данных по изменению карты в форме
Процедура СоздатьДисконтнуюКарту(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Форма = ДополнительныеПараметры.Форма;
		СтруктураПараметровКлиента = ДополнительныеПараметры.СтруктураПараметровКлиента;
		
		СтруктураКарты = Неопределено;
		
		Если Результат = КодВозвратаДиалога.Да Тогда
			
			СтруктураКарты = ИнформационныеКартыВызовСервера.СоздатьДисконтнуюКарту(СтруктураПараметровКлиента.РегистрацияНовойКарты);
			
		ИначеЕсли ТипЗнч(Результат) = Тип("Структура") Тогда
			Если СтруктураПараметровКлиента.Свойство("РегистрацияНовойКартыВыборШаблона")
				И Результат.Свойство("КодКарты")
				И Результат.Свойство("НаименованиеШаблона") Тогда
				МассивШаблонов = ПолучитьИзВременногоХранилища(СтруктураПараметровКлиента.РегистрацияНовойКартыВыборШаблона);
				Для Каждого СтрокаШаблона Из МассивШаблонов Цикл
					Если СтрокаШаблона.НаименованиеШаблона = Результат.НаименованиеШаблона Тогда
						СтруктураКарты = ИнформационныеКартыВызовСервера.СоздатьДисконтнуюКарту(СтрокаШаблона);
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		Если СтруктураКарты <> Неопределено
			И ЗначениеЗаполнено(СтруктураКарты.Карта) Тогда
			
			СтруктураПараметров = ПодключаемоеОборудованиеРТВызовСервера.СтруктураДанныхПоиска();
			СтруктураПараметров.ЗначенияПоиска.Добавить(СтруктураКарты);
			Если ДополнительныеПараметры.Свойство("ЛогироватьСозданиеКарты") Тогда
				СтруктураПараметров.Вставить("ЛогироватьСозданиеКарты", ДополнительныеПараметры.ЛогироватьСозданиеКарты);
			КонецЕсли;
			
			СтруктураПараметров.НеизвестныеДанныеПО = Ложь;
			Форма.ОбработатьДанныеПоКодуСервер(СтруктураПараметров);
			Форма.ОбработатьДанныеПоКодуКлиент(СтруктураПараметров);
			ОповеститьОСозданииНовойКарты(СтруктураКарты.Карта);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Обработка оповещения выбора шаблона для создания дисконтной карты
Процедура ВыборШаблонаСозданияДисконтнойКарты(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
        // &ЗамерПроизводительности
        ОценкаПроизводительностиРТКлиент.НачатьЗамер(
                 Истина, "РегистрСведений.ШаблоныРегистрацииНовыхКарт.Форма.ШаблоныНовыхКарт.Открытие");

        ОбработчикОповещения = Новый ОписаниеОповещения("СоздатьДисконтнуюКарту", ЭтотОбъект, ДополнительныеПараметры);
		РежимОткрытия = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("АдресШаблоновВХранилище", ДополнительныеПараметры.СтруктураПараметровКлиента.РегистрацияНовойКартыВыборШаблона);
		ОткрытьФорму("РегистрСведений.ШаблоныРегистрацииНовыхКарт.Форма.ШаблоныНовыхКарт", ПараметрыОткрытия, , , , , ОбработчикОповещения, РежимОткрытия);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
